; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-2-3-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-8 - location
	p1-7 - location
	p2-7 - location
	p3-4 - location
	p3-9 - location
	p4-5 - location
	p5-1 - location
	p5-3 - location
	p5-9 - location
	p6-0 - location
	p6-4 - location
	p6-5 - location
	p7-4 - location
	p7-6 - location
	p7-9 - location
	p8-2 - location
	p8-7 - location
	p9-1 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s3)
	(at truck1 s7)
	(empty truck1)
	(at truck2 s9)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at package1 s3)
	(at package2 s4)
	(at package3 s9)
	(at package4 s7)
	(at package5 s4)
	(at package6 s1)
	(path s0 p0-8)
	(path p0-8 s0)
	(path s8 p0-8)
	(path p0-8 s8)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(path s9 p9-1)
	(path p9-1 s9)
	(path s1 p9-1)
	(path p9-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s1 s4)
	(link s4 s1)
	(link s1 s7)
	(link s7 s1)
	(link s2 s4)
	(link s4 s2)
	(link s3 s8)
	(link s8 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s9)
	(link s9 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s4)
	(link s4 s5)
	(link s6 s3)
	(link s3 s6)
	(link s6 s8)
	(link s8 s6)
	(link s6 s9)
	(link s9 s6)
	(link s7 s0)
	(link s0 s7)
	(link s7 s2)
	(link s2 s7)
	(link s7 s4)
	(link s4 s7)
	(link s7 s5)
	(link s5 s7)
	(link s7 s6)
	(link s6 s7)
	(link s8 s0)
	(link s0 s8)
	(link s8 s1)
	(link s1 s8)
	(link s8 s5)
	(link s5 s8)
	(link s9 s2)
	(link s2 s9)
	(link s9 s3)
	(link s3 s9)
	(link s9 s7)
	(link s7 s9)
	(link s9 s8)
	(link s8 s9)
)
	(:goal (and
	(at driver1 s4)
	(at driver2 s9)
	(at truck2 s5)
	(at truck3 s0)
	(at package1 s2)
	(at package2 s2)
	(at package3 s9)
	(at package4 s1)
	(at package5 s0)
	(at package6 s2)
	))
(:metric minimize (total-time))
)

; plan
1. (load-truck package4 truck1 s7)
   deleted: (at package4 s7)
   added: (in package4 truck1)
   goals met: 1 of 10
2. (walk driver2 s3 p3-9)
   deleted: (at driver2 s3)
   added: (at driver2 p3-9)
   goals met: 1 of 10
3. (walk driver2 p3-9 s9)
   deleted: (at driver2 p3-9)
   added: (at driver2 s9)
   goals met: 2 of 10
4. (board-truck driver2 truck2 s9)
   deleted: (at driver2 s9) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 1 of 10
5. (drive-truck truck2 s9 s2 driver2)
   deleted: (at truck2 s9)
   added: (at truck2 s2)
   goals met: 1 of 10
6. (drive-truck truck2 s2 s5 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s5)
   goals met: 2 of 10
7. (disembark-truck driver2 truck2 s5)
   deleted: (driving driver2 truck2)
   added: (at driver2 s5) (empty truck2)
   goals met: 2 of 10
8. (walk driver2 s5 p5-9)
   deleted: (at driver2 s5)
   added: (at driver2 p5-9)
   goals met: 2 of 10
9. (walk driver2 p5-9 s9)
   deleted: (at driver2 p5-9)
   added: (at driver2 s9)
   goals met: 3 of 10
10. (walk driver1 s1 p1-7)
   deleted: (at driver1 s1)
   added: (at driver1 p1-7)
   goals met: 3 of 10
11. (walk driver1 p1-7 s7)
   deleted: (at driver1 p1-7)
   added: (at driver1 s7)
   goals met: 3 of 10
12. (board-truck driver1 truck1 s7)
   deleted: (at driver1 s7) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 3 of 10
13. (drive-truck truck1 s7 s1 driver1)
   deleted: (at truck1 s7)
   added: (at truck1 s1)
   goals met: 3 of 10
14. (unload-truck package4 truck1 s1)
   deleted: (in package4 truck1)
   added: (at package4 s1)
   goals met: 4 of 10
15. (load-truck package6 truck1 s1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   goals met: 4 of 10
16. (drive-truck truck1 s1 s3 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 4 of 10
17. (load-truck package1 truck1 s3)
   deleted: (at package1 s3)
   added: (in package1 truck1)
   goals met: 4 of 10
18. (drive-truck truck1 s3 s1 driver1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 4 of 10
19. (drive-truck truck1 s1 s4 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 4 of 10
20. (load-truck package5 truck1 s4)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   goals met: 4 of 10
21. (load-truck package2 truck1 s4)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   goals met: 4 of 10
22. (drive-truck truck1 s4 s0 driver1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 4 of 10
23. (unload-truck package5 truck1 s0)
   deleted: (in package5 truck1)
   added: (at package5 s0)
   goals met: 5 of 10
24. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 5 of 10
25. (unload-truck package6 truck1 s2)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   goals met: 6 of 10
26. (unload-truck package2 truck1 s2)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   goals met: 7 of 10
27. (disembark-truck driver1 truck1 s2)
   deleted: (driving driver1 truck1)
   added: (at driver1 s2) (empty truck1)
   goals met: 7 of 10
28. (board-truck driver1 truck3 s2)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 7 of 10
29. (unload-truck package1 truck1 s2)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   goals met: 8 of 10
30. (drive-truck truck3 s2 s0 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 9 of 10
31. (disembark-truck driver1 truck3 s0)
   deleted: (driving driver1 truck3)
   added: (at driver1 s0) (empty truck3)
   goals met: 9 of 10
32. (walk driver1 s0 p6-0)
   deleted: (at driver1 s0)
   added: (at driver1 p6-0)
   goals met: 9 of 10
33. (walk driver1 p6-0 s6)
   deleted: (at driver1 p6-0)
   added: (at driver1 s6)
   goals met: 9 of 10
34. (walk driver1 s6 p6-4)
   deleted: (at driver1 s6)
   added: (at driver1 p6-4)
   goals met: 9 of 10
35. (walk driver1 p6-4 s4)
   deleted: (at driver1 p6-4)
   added: (at driver1 s4)
   goals met: 10 of 10
